---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ZoneWithoutSpacesWarn
source: html/102b4443-63b1-17eb-c426-e287a86982f0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.ZoneWithoutSpacesWarn Property

This zone has no spaces.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZoneWithoutSpacesWarn { get; }
```